modules/ome-tex.org
#+TITLE: Oh My Emacs TeX
#+OPTIONS: toc:2 num:nil ^:nil

This is part of [[https://github.com/xiaohanyu/oh-my-emacs][oh-my-emacs]].

* Prerequisites
  :PROPERTIES:
  :CUSTOM_ID: tex-prerequisites
  :END:

#+NAME: tex-prerequisites
#+CAPTION: Prerequisites for ome-tex module
| Package  | Windows | Ubuntu/Debian/Mint        | ArchLinux                | Fedora      | Mac OS X | Mandatory? |
|----------+---------+---------------------------+--------------------------+-------------+----------+------------|
| [[http://www.tug.org/texlive/][texlive]]  |         | texlive-full latex-beamer | texlive-most texlive-cjk | texlive-all | [[http://tug.org/mactex/][MacTeX]]   | Yes        |
| [[http://pygments.org/][pygments]] |         | [pip]                     | [pip]                    | [pip]       | [pip]    | No         |

Note:
- [[http://www.tug.org/texlive/][texlive]], the full texlive distribution is really huge, so install necessary
  parts as you need.
- [[http://en.wikipedia.org/wiki/MacTeX][MacTeX]] is a redistribution of texlive, which includes Mac-specific utilities
  and front-ends. It is also pre-configured to work out-of-the-box with Mac OS
  X as it provides sensible defaults for configuration options that, in TeX
  Live, are left up to the user to allow for its cross-platform compatibility.

* El-get packages
  :PROPERTIES:
  :CUSTOM_ID: tex-el-get-packages
  :END:

#+NAME: tex-el-get-packages
#+CAPTION: El-get packages for ome-tex module
| Package | Status   | Description              |
|---------+----------+--------------------------|
| [[http://www.gnu.org/software/auctex/][AUCTeX]]  | Required | You need it, believe me. |
| [[http://staff.science.uva.nl/~dominik/Tools/cdlatex/][CDLaTeX]] | Optional | Speedy \LaTeX{} typing.  |

* AUCTeX
  :PROPERTIES:
  :CUSTOM_ID: auctex
  :END:

[[http://www.gnu.org/software/auctex/][AUCTeX]] is the predominant \TeX{}/\LaTeX{} writing environment for
Emacs/XEmacs.

** Prerequisites and Installation
\TeX{} is a long history legend in computer typesetting. To configure a
working \TeX{} environment is far beyond the scope of this project. However,
I can give you some hint to install a \TeX{} system on Linux. If you are
- a Ubuntu/Debian/Mint user, install texlive by =sudo apt-get install
  texlive-full=
- a Arch Linux user, install texlive by =sudo pacman -S texlive-most
  texlive-langcjk=
- a Fedora user, install texlive by =sudo yum -S texlive-all=
- a SuSE user, install texlive by =sudo zypper in texlive-xetex=

For Mac OS X users, [[http://tug.org/mactex/][MacTeX]] is the best choice. You can install it directly from
its website or via [[https://github.com/phinze/homebrew-cask][homebrew-cask]]. By default, MacTeX install all binary
executables to =/usr/texbin/=, which is different from Linux.

If you are not lucky enough, you should follow the official [[http://www.tug.org/texlive/][texlive]]
instructions to install it.

There're other annoying problems if you're a [[http://en.wikipedia.org/wiki/CJK_characters][CJK]] user, such as fonts and
package configuration in \TeX{} documents, but this is further beyond the scope
of this project. So refer to necessary [[https://tug.org/][TUG]]s, or BBS for help. For Chinese user,
[[http://www.ctex.org/][CTEX]] is a good place to start your journey. [[http://zzg34b.w3.c361.com/][LaTeX编辑部]] also provides lots of
useful resources written in Chinese.

For all \TeX{} users, the Comprehensive TEX Archive Network ([[http://www.ctan.org/][CTAN]]) is your
lifelong friend, which act as the central place for all kinds of material
around \TeX{}. The famous Stack Exchange Network also provides a
http://tex.stackexchange.com/ which focus on \TeX{} related questions.

Enough, enjoy your journey to \TeX{} world! Now it's time to come back to
AUCTeX. Besides a working \TeX{} installation, you also need =autoconf= and
=texinfo= package for =el-get-install auctex=, and a recent [[http://www.ghostscript.com/][Ghostscript]] for
=preview-latex= in both [[http://en.wikipedia.org/wiki/Device_independent_file_format][DVI]] and [[http://en.wikipedia.org/wiki/Pdf][PDF]] mode.

Finally, if you're tired or afraid to setup a working \TeX{} environment,
[[https://www.writelatex.com/][writelatex]] provides a really instance starting point with no pain, just try it
before you fall in love with \TeX{} world.

** Keybindings
AUCTeX is really flexible and customizable, it also provides a rich set of
menubar entries. Here's a list of most commonly used keybindings in AUCTeX:
- Editing
  - =C-c C-s= =LaTeX-section=
  - =C-c C-e= =LaTeX-environment=
  - =C-c C-m= =TeX-insert-macro=
  - =C-c ]= =LaTeX-close-environment=
- Marking and Commenting
  - =C-c *= =LaTeX-mark-section=
  - =C-c .= =LaTeX-mark-environment=
  - =C-c ;= =TeX-comment-or-uncomment-region=
  - =C-c %= =TeX-comment-or-uncomment-paragraph=
- Folding:
  - =C-c C-o C-b= =TeX-fold-buffer=
  - =C-c C-o b= =TeX-fold-clearout-buffer=
- Command Controlling
  - =C-c C-c= =TeX-command-master=
  - =C-c C-r= =TeX-command-region=
  - =C-c C-b= =TeX-command-buffer=
  - =C-c C-k= =TeX-kill-job=
  - =C-c C-l= =TeX-recenter-output-buffer=
  - =C-c ^= =TeX-home-buffer=

** Checking
[[http://www.ctan.org/tex-archive/support/lacheck/][lacheck]] and [[http://baruch.ev-en.org/proj/chktex/][chktex]] is the lint tool for \TeX{}, you can install them in Ubuntu
by =sudo apt-get install lacheck chktex=. AUCTeX has direct support for
=lacheck= and =chktex=. You can start =lacheck= with =C-c C-c Check <RET>= and
=chktex= with =C-c C-c ChkTeX <RET>=.

Each of the two utilities will find some errors the other doesn't, but =chktex=
is more configurable, allowing you to create your own errors

