modules/ome-tex.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Oh My Emacs TeX</title>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="title" content="Oh My Emacs TeX"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2013-12-30T17:03+0800"/>
<meta name="author" content=""/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>

</head>
<body>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">Oh My Emacs TeX</h1>

<p>This is part of the <a href="https://github.com/xiaohanyu/oh-my-emacs">oh-my-emacs</a>.
</p>

<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#tex-prerequisites">Prerequisites</a></li>
<li><a href="#tex-el-get-packages">El-get packages</a></li>
<li><a href="#auctex">AUCTeX</a>
<ul>
<li><a href="#sec-3-1">Prerequisites and Installation</a></li>
<li><a href="#sec-3-2">Keybindings</a></li>
<li><a href="#sec-3-3">Checking</a></li>
<li><a href="#sec-3-4">Reftex</a></li>
<li><a href="#sec-3-5">Coordinations with other packages</a></li>
<li><a href="#sec-3-6">Oh-my-emacs settings</a></li>
<li><a href="#sec-3-7">Tips and Tricks</a></li>
<li><a href="#sec-3-8">Todo</a></li>
</ul>
</li>
<li><a href="#cdlatex">CDLaTeX</a></li>
<li><a href="#sec-5">Todo</a>
<ul>
<li><a href="#sec-5-1">AUCTeX</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-tex-prerequisites" class="outline-2">
<h2 id="tex-prerequisites"><a name="sec-1" id="sec-1"></a>Prerequisites</h2>
<div class="outline-text-2" id="text-tex-prerequisites">


<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<caption>Prerequisites for ome-tex module</caption>
<colgroup><col class="left" /><col class="left" /><col class="left" /><col class="left" /><col class="left" /><col class="left" /><col class="left" />
</colgroup>
<thead>
<tr><th scope="col" class="left"></th><th scope="col" class="left">Windows</th><th scope="col" class="left">Ubuntu/Debian/Mint</th><th scope="col" class="left">ArchLinux</th><th scope="col" class="left">Fedora</th><th scope="col" class="left">Mac OS X</th><th scope="col" class="left">Mandatory?</th></tr>
</thead>
<tbody>
<tr><td class="left"><a href="http://www.tug.org/texlive/">texlive</a></td><td class="left"></td><td class="left">texlive-full latex-beamer</td><td class="left">texlive-most texlive-cjk</td><td class="left">texlive-all</td><td class="left"><a href="http://tug.org/mactex/">MacTeX</a></td><td class="left">Yes</td></tr>
<tr><td class="left"><a href="http://pygments.org/">pygments</a></td><td class="left"></td><td class="left">[pip]</td><td class="left">[pip]</td><td class="left">[pip]</td><td class="left">[pip]</td><td class="left">No</td></tr>
</tbody>
</table>


<p>
Note:
</p><ul>
<li><a href="http://www.tug.org/texlive/">texlive</a>, the full texlive distribution is really huge, so install necessary
  parts as you need.
</li>
<li><a href="http://en.wikipedia.org/wiki/MacTeX">MacTeX</a> is a redistribution of texlive, which includes Mac-specific utilities
  and front-ends. It is also pre-configured to work out-of-the-box with Mac OS
  X as it provides sensible defaults for configuration options that, in TeX
  Live, are left up to the user to allow for its cross-platform compatibility.
</li>
</ul>


</div>

</div>

<div id="outline-container-tex-el-get-packages" class="outline-2">
<h2 id="tex-el-get-packages"><a name="sec-2" id="sec-2"></a>El-get packages</h2>
<div class="outline-text-2" id="text-tex-el-get-packages">


<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<caption>El-get packages for ome-tex module</caption>
<colgroup><col class="left" /><col class="left" /><col class="left" />
</colgroup>
<thead>
<tr><th scope="col" class="left"></th><th scope="col" class="left">Status</th><th scope="col" class="left">Description</th></tr>
</thead>
<tbody>
<tr><td class="left"><a href="http://www.gnu.org/software/auctex/">AUCTeX</a></td><td class="left">Required</td><td class="left">You need it, believe me.</td></tr>
<tr><td class="left"><a href="http://staff.science.uva.nl/~dominik/Tools/cdlatex/">CDLaTeX</a></td><td class="left">Optional</td><td class="left">Speedy \LaTeX{} typing.</td></tr>
</tbody>
</table>


</div>

</div>

<div id="outline-container-auctex" class="outline-2">
<h2 id="auctex"><a name="sec-3" id="sec-3"></a>AUCTeX</h2>
<div class="outline-text-2" id="text-auctex">


<p>
<a href="http://www.gnu.org/software/auctex/">AUCTeX</a> is the predominant \TeX{}/\LaTeX{} writing environment for
Emacs/XEmacs.
</p>

</div>

<div id="outline-container-3-1" class="outline-3">
<h3 id="sec-3-1">Prerequisites and Installation</h3>
<div class="outline-text-3" id="text-3-1">

<p>\TeX{} is a long history legend in computer typesetting. To configure a
working \TeX{} environment is far beyond the scope of this project. However,
I can give you some hint to install a \TeX{} system on Linux. If you are
</p><ul>
<li>a Ubuntu/Debian/Mint user, install texlive by <code>sudo apt-get install   texlive-full</code>
</li>
<li>a Arch Linux user, install texlive by <code>sudo pacman -S texlive-most   texlive-langcjk</code>
</li>
<li>a Fedora user, install texlive by <code>sudo yum -S texlive-all</code>
</li>
<li>a SuSE user, install texlive by <code>sudo zypper in texlive-xetex</code>
</li>
</ul>


<p>
For Mac OS X users, <a href="http://tug.org/mactex/">MacTeX</a> is the best choice. You can install it directly from
its website or via <a href="https://github.com/phinze/homebrew-cask">homebrew-cask</a>. By default, MacTeX install all binary
executables to <code>/usr/texbin/</code>, which is different from Linux.
</p>
<p>
If you are not lucky enough, you should follow the official <a href="http://www.tug.org/texlive/">texlive</a>
instructions to install it.
</p>
<p>
There're other annoying problems if you're a <a href="http://en.wikipedia.org/wiki/CJK_characters">CJK</a> user, such as fonts and
package configuration in \TeX{} documents, but this is further beyond the scope
of this project. So refer to necessary <a href="https://tug.org/">TUG</a>s, or BBS for help. For Chinese user,
<a href="http://www.ctex.org/">CTEX</a> is a good place to start your journey. <a href="http://zzg34b.w3.c361.com/">LaTeX编辑部</a> also provides lots of
useful resources written in Chinese.
</p>
<p>
For all \TeX{} users, the Comprehensive TEX Archive Network (<a href="http://www.ctan.org/">CTAN</a>) is your
lifelong friend, which act as the central place for all kinds of material
around \TeX{}. The famous Stack Exchange Network also provides a
<a href="http://tex.stackexchange.com/">http://tex.stackexchange.com/</a> which focus on \TeX{} related questions.
</p>
<p>
Enough, enjoy your journey to \TeX{} world! Now it's time to come back to
AUCTeX. Besides a working \TeX{} installation, you also need <code>autoconf</code> and
<code>texinfo</code> package for <code>el-get-install auctex</code>, and a recent <a href="http://www.ghostscript.com/">Ghostscript</a> for
<code>preview-latex</code> in both <a href="http://en.wikipedia.org/wiki/Device_independent_file_format">DVI</a> and <a href="http://en.wikipedia.org/wiki/Pdf">PDF</a> mode.
</p>
<p>
Finally, if you're tired or afraid to setup a working \TeX{} environment,
<a href="https://www.writelatex.com/">writelatex</a> provides a really instance starting point with no pain, just try it
before you fall in love with \TeX{} world.
</p>
</div>

</div>

<div id="outline-container-3-2" class="outline-3">
<h3 id="sec-3-2">Keybindings</h3>
<div class="outline-text-3" id="text-3-2">

<p>AUCTeX is really flexible and customizable, it also provides a rich set of
menubar entries. Here's a list of most commonly used keybindings in AUCTeX:
</p><ul>
<li>Editing
<ul>
<li><code>C-c C-s</code> <code>LaTeX-section</code>
</li>
<li><code>C-c C-e</code> <code>LaTeX-environment</code>
</li>
<li><code>C-c C-m</code> <code>TeX-insert-macro</code>
</li>
<li><code>C-c ]</code> <code>LaTeX-close-environment</code>
</li>
</ul>

</li>
<li>Marking and Commenting
<ul>
<li><code>C-c *</code> <code>LaTeX-mark-section</code>
</li>
<li><code>C-c .</code> <code>LaTeX-mark-environment</code>
</li>
<li><code>C-c ;</code> <code>TeX-comment-or-uncomment-region</code>
</li>
<li><code>C-c %</code> <code>TeX-comment-or-uncomment-paragraph</code>
</li>
</ul>

</li>
<li>Folding:
<ul>
<li><code>C-c C-o C-b</code> <code>TeX-fold-buffer</code>
</li>
<li><code>C-c C-o b</code> <code>TeX-fold-clearout-buffer</code>
</li>
</ul>

</li>
<li>Command Controlling
<ul>
<li><code>C-c C-c</code> <code>TeX-command-master</code>
</li>
<li><code>C-c C-r</code> <code>TeX-command-region</code>
</li>
<li><code>C-c C-b</code> <code>TeX-command-buffer</code>
</li>
<li><code>C-c C-k</code> <code>TeX-kill-job</code>
</li>
<li><code>C-c C-l</code> <code>TeX-recenter-output-buffer</code>
</li>
<li><code>C-c ^</code> <code>TeX-home-buffer</code>
</li>
</ul>

</li>
</ul>


</div>

</div>

<div id="outline-container-3-3" class="outline-3">
<h3 id="sec-3-3">Checking</h3>
<div class="outline-text-3" id="text-3-3">

<p><a href="http://www.ctan.org/tex-archive/support/lacheck/">lacheck</a> and <a href="http://baruch.ev-en.org/proj/chktex/">chktex</a> is the lint tool for \TeX{}, you can install them in Ubuntu
by <code>sudo apt-get install lacheck chktex</code>. AUCTeX has direct support for
<code>lacheck</code> and <code>chktex</code>. You can start <code>lacheck</code> with <code>C-c C-c Check &lt;RET&gt;</code> and
<code>chktex</code> with <code>C-c C-c ChkTeX &lt;RET&gt;</code>.
</p>
<p>
Each of the two utilities will find some errors the other doesn't, but <code>chktex</code>
is more configurable, allowing you to create your own errors
</p>
</div>

</div>
