modules/ome-tex.html

<div id="outline-container-3-4" class="outline-3">
<h3 id="sec-3-4">Reftex</h3>
<div class="outline-text-3" id="text-3-4">

<ul>
<li><code>C-c =</code> <code>reftex-toc</code> will show a table of contents of the document.
</li>
<li><code>C-c (</code> <code>reftex-label</code> to insert a label at point.
</li>
<li><code>C-c [</code> <code>reftex-citation</code> to insert a citations from BibTeX database.
</li>
</ul>


</div>

</div>

<div id="outline-container-3-5" class="outline-3">
<h3 id="sec-3-5">Coordinations with other packages</h3>
<div class="outline-text-3" id="text-3-5">

<p>Oh-my-emacs adopts some other awesome packages such as <code>smartparens</code> and
<code>evil</code>, which has some conflicts with AUCTeX. so there need some hack, which,
is always the main topic with Emacs.
</p>
<p>
<code>smartparens-latex</code> provide some goodies for \TeX{} editing. But we need to
ensure <code>smartparens</code> is available before we <code>require 'smartparens-latex</code>.
</p>
<p>
<code>smartparens</code> still has some weird problems for inserting "$" in \TeX{}, which
is a weird problem. In fact, both AUCTeX and <code>smartparens</code> provides some pair
management functions, which may be overlapping. AUCTeX provide a
<code>TeX-electric-math</code>, while <code>smartparens</code> was born for pair management. Worse,
the following <code>cdlatex.el</code> also provides some pair management functions. Ah, we
need some coordination between them. So any ideas or patches will be
appreciated.
</p>
<p>
Another oh-my-emacs package, <code>evil</code>, shadowed some keybindings for AUCTeX's
<code>reftex-toc-mode</code>. However, I only enable <code>evil-mode</code> in <code>text-mode-hook</code> and
<code>prog-mode-hook</code>, and <code>reftex-toc-mode</code> is derived from <code>fundamental-mode</code>, I
have no idea why <code>evil-local-mode</code> is enabled by default when entering
<code>reftex-toc-mode</code>, so I have to <code>turn-off-evil-mode</code> explicitly.
</p>
</div>

</div>

<div id="outline-container-3-6" class="outline-3">
<h3 id="sec-3-6">Oh-my-emacs settings</h3>
<div class="outline-text-3" id="text-3-6">

<ul>
<li>Use <code>xetex</code> as the default <code>TeX-engine</code> for better support for \TeX{} font
  selection and PDF export.
</li>
<li>Enable <code>outline-minor-mode</code> and <code>flyspell-mode</code>.
</li>
<li>Enable <code>TeX-interactive-mode</code>, <code>TeX-PDF-mode</code>, <code>TeX-fold-mode</code> and
  <code>reftex-mode</code>.
</li>
<li>Favors <a href="http://okular.kde.org/">Okular</a> and <a href="https://projects.gnome.org/evince/">Evince</a> as the default viewer in Linux, and fallbacks to
  <code>xdg-open</code> if both Okular and Evince is unavailable. Since I don't have a
  Windows or Mac OS X environment, patches are always welcome.
</li>
</ul>





<pre class="example">(defun ome-auctex-setup ()
  (when (require 'smartparens nil 'noerror)
    (require 'smartparens-latex))
  (setq TeX-auto-save t)                ; Automatically save style information
                                        ; when saving the buffer
  (setq TeX-parse-self t)               ; Parse file after loading it if no
                                        ; style hook is found for it.
  (setq LaTeX-syntactic-comment t)
  (setq TeX-auto-untabify t)            ; remove all tabs before saving
  (setq reftex-plug-into-AUCTeX t)
  (setq-default TeX-engine 'xetex)      ; use xelatex by default

  ;; Mac OS X fallback to the "open" program as the default viewer for all
  ;; types of files.
  (cond
   ;; settings for Linux
   ((eq system-type 'gnu/linux)
    (cond
     ((executable-find "okular")
      (setq TeX-view-program-selection
            '((output-pdf "Okular")
              (output-dvi "Okular"))))
     ((executable-find "evince")
      (setq TeX-view-program-selection
            '((output-pdf "Evince")
              (output-dvi "Evince"))))
     (t
      (setq TeX-view-program-selection
            '((output-pdf "xdg-open")
              (output-dvi "xdg-open")))))))

  (add-hook 'TeX-mode-hook
            (lambda ()
              (outline-minor-mode t)
              (flyspell-mode t)
              (TeX-interactive-mode t)
              (TeX-PDF-mode t)
              (TeX-fold-mode t)))

  (add-hook 'LaTeX-mode-hook
            (lambda ()
              (LaTeX-math-mode t)
              (reftex-mode t)))

  (add-hook 'reftex-toc-mode-hook
            (lambda ()
              (when (featurep 'evil)
                (turn-off-evil-mode)))))

(when (executable-find
       (if (eq system-type 'darwin)
           ;; MacTeX install all its executables to /usr/texbin directory
           "/usr/texbin/pdflatex"
         "pdflatex"))
  (ome-install 'auctex))
</pre>


</div>

</div>

<div id="outline-container-3-7" class="outline-3">
<h3 id="sec-3-7">Tips and Tricks</h3>
<div class="outline-text-3" id="text-3-7">

<p><a href="http://tex.stackexchange.com/questions/52179/what-is-your-favorite-emacs-and-or-auctex-command-trick">Here</a>'s some tips and tricks about AUCTeX.
</p>

</div>

<div id="outline-container-3-7-1" class="outline-4">
<h4 id="sec-3-7-1">LaTeX shell escape</h4>
<div class="outline-text-4" id="text-3-7-1">


<p>
\LaTeX{} supports an lesser known "shell-escape" feature. In a word, this mode
can be used to incorporate dynamic content, or run external process during the
compilation phase. Check this <a href="http://scrolls.mafgani.net/2011/03/latex-shell-escape/">post</a> for details.
</p>
<p>
Unfortunately, there no easy explicit way to customize command line options for
various AUCTeX backend. So we need some tricks to get around this. Thanks
<a href="http://stackoverflow.com/questions/3300497/using-minted-source-code-latex-package-with-emacs-auctex/">stackoverflow</a> again, here's the code snippet for AUCTeX \LaTeX{} backend.
</p>



<pre class="example">(defvar ome-LaTeX-shell-escape-mode nil
  "Whether or not LaTeX shell escape mode is enabled.")

(defun ome-LaTeX-toggle-shell-escape ()
  (interactive)
  (if ome-LaTeX-shell-escape-mode
      (progn
        (setcdr (assoc "LaTeX" TeX-command-list)
                '("%`%l%(mode)%' %t"
                  TeX-run-TeX nil (latex-mode doctex-mode) :help "Run LaTeX"))
        (setq ome-LaTeX-shell-escape-mode nil)
        (message "LaTeX shell escape mode turned off."))
    (progn
      (setcdr (assoc "LaTeX" TeX-command-list)
              '("%`%l%(mode) -shell-escape%' %t"
                TeX-run-TeX nil (latex-mode doctex-mode) :help "Run LaTeX")))
    (setq ome-LaTeX-shell-escape-mode t)
    (message "LaTeX shell escape mode turned on.")))

;; (define-key org-mode-map (kbd "C-c C-x x") 'ome-LaTeX-toggle-shell-escape)
</pre>


</div>
</div>

</div>

<div id="outline-container-3-8" class="outline-3">
<h3 id="sec-3-8">Todo</h3>
<div class="outline-text-3" id="text-3-8">

<ul>
<li>Add <code>auto-complete</code> support,
  <a href="https://github.com/monsanto/auto-complete-auctex">https://github.com/monsanto/auto-complete-auctex</a>.
</li>
</ul>


</div>
</div>

</div>

<div id="outline-container-cdlatex" class="outline-2">
<h2 id="cdlatex"><a name="sec-4" id="sec-4"></a>CDLaTeX</h2>
<div class="outline-text-2" id="text-cdlatex">


<blockquote>

<p>CDLaTeX - more LaTeX functionality for Emacs and XEmacs
</p>
<p>
CDLaTeX is a minor mode which re-implements many features also found in the
AUCTeX LaTeX mode. The reason for this is mainly historical - much of it was
written before I knew about AUCTeX. So check this out if you would like to try
a different implementation.  Here are some of the differences: Environment
insertion is template based, and not hook based. Keyword commands (which are
executed by typing a short (2-4 letters) keyword into the buffer, followed by
TAB) give very rapid access to the main environment templates and mathematical
constructs. CDLaTeX knows the difference between text mode and math mode in
LaTeX and adapts automatically to that. You can download CDLaTeX here.
</p>
<p>
&ndash; <a href="http://staff.science.uva.nl/~dominik/Tools/cdlatex/">http://staff.science.uva.nl/~dominik/Tools/cdlatex/</a>
</p>
</blockquote>


<p>
The comments in <code>cdlatex.el</code> said that "CDLaTeX requires texmathp.el which is
distributed with AUCTeX. Starting with Emacs 21.3, texmathp.el will be part of
Emacs.", however, I didn't find any <code>texmathp.el</code> with current emacs
distribution. So CDLaTeX requires AUCTeX as a dependency, which means it didn't
work with Emacs builtin <code>tex-mode</code> anymore.
</p>



<pre class="example">(defun ome-cdlatex-mode-setup ()
  (add-hook 'LaTeX-mode-hook 'turn-on-cdlatex)
  (add-hook 'latex-mode-hook 'turn-on-cdlatex))

(when (el-get-package-is-installed 'auctex)
  (ome-install 'cdlatex-mode))

</pre>


</div>

</div>
