modules/ome-tex.org
** AUCTeX
- Add auto-complete support for auctex. see
  https://github.com/monsanto/auto-complete-auctex.
- Investigate on "What is TeX master file?"
- What is SyncTeX? How to use it?
- What is =TeX-interactive-mode=?
