modules/ome-tex.html

<div id="outline-container-5" class="outline-2">
<h2 id="sec-5">Todo</h2>
<div class="outline-text-2" id="text-5">



</div>

<div id="outline-container-5-1" class="outline-3">
<h3 id="sec-5-1">AUCTeX</h3>
<div class="outline-text-3" id="text-5-1">

<ul>
<li>Add auto-complete support for auctex. see
  <a href="https://github.com/monsanto/auto-complete-auctex">https://github.com/monsanto/auto-complete-auctex</a>.
</li>
<li>Investigate on "What is TeX master file?"
</li>
<li>What is SyncTeX? How to use it?
</li>
<li>What is <code>TeX-interactive-mode</code>?
</li>
</ul>

</div>
</div>
</div>
</div>

</body>
</html>
